Catalogs/бит_ШаблоныИзвещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныИзвещений</Name>
			<Comment>Шаблоны извещений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сальдо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредит</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/бит_ГрафыОтчетаПоГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ГрафыОтчетаПоГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаНайм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывозБытовыхОтходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отопление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорячееВодоснобжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХолодноеВодоснабжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаСтоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХВСДляГВС</Name>
					<Comment>Холодная вода для подогрева и обеспечения горячего водоснабжения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ШаблоныИзвещений/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыДействияКомандФормы

&НаКлиенте
Процедура ID(Команда)
	
	ОчиститьСообщения();
	
	IDНасервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	// БИТ_ЖКХ 08.06.2016 14:05:39 Начало правки...
	//СписокТипов = Новый СписокЗначений;
	//СписокТипов.Добавить("бит_УслугиЖКХ"           , "Услуги ЖКХ");
	//СписокТипов.Добавить("бит_бу_БиллинговыеУслуги", "Биллинговые услуги");
	//
	//Тип = Неопределено;
	//
	//СписокТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект), "Выберите справочник.");

	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.КапитальныйРемонт") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		Отбор = Новый Структура;
		Отбор.Вставить("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт"));
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.ФормаВыбора", ПараметрыФормы, Элементы.Услуги, ЭтаФорма);
		
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.БезКапитальногоРемонта") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		Отбор = Новый Структура;
		Отбор.Вставить("ГрафаОтчетаГЦЖС", ПолучитьСписокГЦЖС());
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.ФормаВыбора", ПараметрыФормы, Элементы.Услуги, ЭтаФорма);
		
	Иначе
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.Добавить("бит_УслугиЖКХ"           , "Услуги ЖКХ");
		СписокТипов.Добавить("бит_бу_БиллинговыеУслуги", "Биллинговые услуги");
		
		Тип = Неопределено;
		
		СписокТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект), "Выберите справочник.");
	КонецЕсли; 
	// БИТ_ЖКХ 08.06.2016 14:05:47 Конец правки.
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Тип = ВыбранныйЭлемент;
	
	Если Тип = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	Форма = ?(Тип.Значение = "бит_УслугиЖКХ", "ФормаВыбораУправляемая", "ФормаВыбораУправляемая");
	
	ОткрытьФорму("Справочник."+Тип.Значение+".Форма."+Форма, ПараметрыФормы, Элементы.Услуги, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляУслуги

&НаКлиенте
Процедура УслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено ИЛИ ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Услуга Из ВыбранноеЗначение Цикл
		
		Отбор = Новый Структура ("Услуга", Услуга);
		
		НайденныеСтроки = Объект.Услуги.НайтиСтроки(Отбор);
		
		КоличествоСтрок = НайденныеСтроки.Количество();
		
		Если КоличествоСтрок = 0 И НЕ Услуга = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.Пеня") Тогда
			
			НоваяСтрока = Объект.Услуги.Добавить();
			НоваяСтрока.Услуга = Услуга;
			
		Иначе
			ПоказатьПредупреждение(Новый ОписаниеОповещения("УслугиОбработкаВыбораЗавершение", ЭтотОбъект), "Услуги дублируются, выберите другую(кроме пени)");
			
		КонецЕсли; 
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОбработкаВыбораЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//СписокТипов = ПолучитьСписокТиповНаСервере();
	//
	//ВыбранныйЭлемент = Неопределено;
	//
	//ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиУслугаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокТипов, Элемент);
	
	// БИТ_ЖКХ 07.06.2016 17:54:10 Начало правки... 
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.КапитальныйРемонт") Тогда
		
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("ГрафаОтчетаГЦЖС", ПредопределенноеЗначение("Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт"));
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.ФормаВыбора", ПараметрыОтбора, Элемент);
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.БезКапитальногоРемонта") Тогда
		
		ПараметрыОтбора = Новый Структура;
		Отбор = Новый Структура;
		Отбор.Вставить("ГрафаОтчетаГЦЖС", ПолучитьСписокГЦЖС());
		ПараметрыОтбора.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.ФормаВыбора", ПараметрыОтбора, Элемент);
	Иначе
		СписокТипов = ПолучитьСписокТиповНаСервере();
		ВыбранныйЭлемент = Неопределено;
		ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("УслугиУслугаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокТипов, Элемент);
	КонецЕсли;
	// БИТ_ЖКХ 07.06.2016 17:54:13 Конец правки. 
	
КонецПроцедуры

// БИТ_ЖКХ 07.06.2016 18:26:27 Начало правки...
&НаСервереБезКонтекста
Функция ПолучитьСписокГЦЖС()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ГрафыОтчетаПоГЦЖС.Ссылка
	|ИЗ
	|	Перечисление.бит_ГрафыОтчетаПоГЦЖС КАК бит_ГрафыОтчетаПоГЦЖС
	|ГДЕ
	|	бит_ГрафыОтчетаПоГЦЖС.Ссылка <> ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.бит_ГрафыОтчетаПоГЦЖС.ПустаяСсылка)";
	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
// БИТ_ЖКХ 07.06.2016 18:26:27 Конец правки.

&НаКлиенте
Процедура УслугиУслугаНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если ВыбранныйЭлемент = Неопределено Тогда // Отказ от выбора.
		Возврат;
	КонецЕсли;
	
	ВыбранныйТип = ВыбранныйЭлемент.Значение;
	ОткрытьФорму("Справочник."+ВыбранныйТип+".ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ВыбранноеЗначение = Неопределено  Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура ("Услуга", ВыбранноеЗначение);
	
	НайденныеСтроки = Объект.Услуги.НайтиСтроки(Отбор);
	
	КоличествоСтрок = НайденныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 И НЕ ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.бит_УслугиЖКХ.Пеня") Тогда
		
	Иначе	
		
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(Новый ОписаниеОповещения("УслугиУслугаОбработкаВыбораЗавершение", ЭтотОбъект), "Услуги дублируются, выберите другую(кроме пени)");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаОбработкаВыбораЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекСтрока.Услуга = Неопределено  Тогда
		
		// БИТ_ЖКХ 07.06.2016 18:11:03 Начало правки... 
		//Отказ = Истина;	
		ОтменаРедактирования = Истина;
		ПоказатьПредупреждение(Новый ОписаниеОповещения("УслугиПередОкончаниемРедактированияЗавершение", ЭтотОбъект), "Выберите услугу");
		Объект.Услуги.Удалить(ТекСтрока);
		// БИТ_ЖКХ 07.06.2016 18:11:05 Конец правки. 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередОкончаниемРедактированияЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура IDНасервере()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ШаблоныИзвещений"));
	
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Идентификатор: " + СправочникОбъект.Идентификатор);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСписокТиповНаСервере()
	
	СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_ШаблоныИзвещений"));
	
	МассивТипов = СправочникОбъект.Метаданные().ТабличныеЧасти.Услуги.Реквизиты.Услуга.Тип.Типы();	
	
	СписокТипов = Новый СписокЗначений;
	Для каждого ЭлементМассива Из МассивТипов Цикл
		
		ПустоеЗначение = Новый(ЭлементМассива);
		ОбъектОписанияМетаданных = ПустоеЗначение.Метаданные();
		СписокТипов.Добавить(ОбъектОписанияМетаданных.Имя, ОбъектОписанияМетаданных.Представление());
		
	КонецЦикла; 
	
	Возврат  СписокТипов;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка фильтра автоподбора и быстрого выбора
	Если Объект.Ссылка = Справочники.бит_ШаблоныИзвещений.КапитальныйРемонт Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ГрафаОтчетаГЦЖС", Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.УслугиУслуга.ПараметрыВыбора = НовыеПараметры;
		
	ИначеЕсли Объект.Ссылка = Справочники.бит_ШаблоныИзвещений.БезКапитальногоРемонта Тогда	
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ГрафаОтчетаГЦЖС", ПолучитьСписокГЦЖС());
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.УслугиУслуга.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 07.06.2016 17:39:45 Конец правки.

#КонецОбласти
